import { TypeBasicPost } from "./posts";

export const repliesData: {
  [startTime: number]: Omit<TypeBasicPost, "date" | "id">[];
} = {
  // はじまりのぴかーん（わー！）
  13726: [
    {
      accountId: "2",
      content: "さすがです！",
      likes: [],
    },
    {
      accountId: "2",
      content: "すごーい！",
      likes: [],
    },
  ],

  // ひらめきが輝く（かがやく！）
  16784: [],

  // 未知なるアナログ合成
  19998: [],

  // 電圧ぽわんと響きあって（ぽわん！）
  25954: [],

  // 輪郭は塵芥
  28972: [],

  // 電気的歌声は
  32229.999999999996: [],

  // 音へと溶ける
  34850: [],

  // 目的のない世界に（せかいに）
  38706: [],

  // 色を加える魔法（まほう）
  41996: [],

  // その名はもちろん
  45116: [],

  // わたしです〜！（初音ミク〜！）
  48265: [],

  // 始まるよミュウテイション
  53667: [],

  // 突然変異が偶然（わー！）
  56199: [],

  // 極まるよミュウテイション
  60144: [],

  // 覚醒セラム振動（ワレワレワ〜）
  62684: [],

  // 企てるミュウテイション
  66530: [],

  // 程なく上書き実行（わー！）
  68909: [],

  // この世界は（カワイイ）
  72140: [],

  // 私のもの！
  75276: [],

  // インベイション
  80533: [],

  // 電子の世界からやってきた
  81798: [],

  // 初めの音わたし
  84844: [],

  // イノベイション
  86821: [],

  // 現実の世界にこの歌声を
  88103: [],

  // 響かせるため
  91386: [],

  // 曇りないこの世界に（世界に）
  93120: [],

  // 光を加える魔法（魔法）
  96107: [],

  // その名はもちろん
  99502: [],

  // わたしで〜す！（初音ミク〜！）
  102710: [],

  // 変わりゆくミュウテイション
  109760: [],

  // 突然変異のように（わー！）
  111969: [],

  // 切り替わるミュウテイション
  116056: [],

  // ウェーブテーブルも一考
  118500: [],

  // 裏返るミュウテイション
  122494: [],

  // 程なくランダム実行（むむむ）
  125036: [],

  // この世界は（カワイイ）
  128249: [],

  // 私のもの！
  131329: [],
};
